#Functions

#Basic Aggregate Functions:

In [1]:
from google.colab import files
uploaded = files.upload()

Saving Mavenmovies.sql to Mavenmovies.sql

1.Retrieve the total number of rentals made in the Sakila database.

In [9]:
#code
import sqlite3
import io
conn = sqlite3.connect(':memory:')
cursor = conn.cursor()
sql_content = uploaded['Mavenmovies.sql'].decode('utf-8')
statements = sql_content.split(';')
for statement in statements:
    if statement.strip():
        try:
            cursor.execute(statement + ';')
        except Exception as e:
            print(f"Error executing statement: {statement[:100]}...")
            print(f"Error: {e}")
conn.commit()
%sql sqlite:///:memory:

Error executing statement:  LOSS OF USE, DATA, OR PROFITS...
Error: near "LOSS": syntax error
Error executing statement:  OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRIC...
Error: near "OR": syntax error
Error executing statement:
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0...
Error: near "SET": syntax error
Error executing statement:  -- commenting out for Maven Course to avoid concerning warning message
CREATE SCHEMA mavenmovies...
Error: near "SCHEMA": syntax error
Error executing statement:
USE mavenmovies...
Error: near "USE": syntax error
Error executing statement:

--
-- Table structure for table `actor`
--

CREATE TABLE actor (
  actor_id SMALLINT UNSIGNED NOT ...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `actor`
--

CREATE TABLE actor_award (
  actor_award_id SMALLINT U...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `address`
--

CREATE TABLE address (
  address_id SMALLINT UNSIGNE...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `advisor`
--

CREATE TABLE advisor (
  advisor_id SMALLINT UNSIGNE...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `category`
--

CREATE TABLE category (
  category_id TINYINT UNSIG...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `city`
--

CREATE TABLE city (
  city_id SMALLINT UNSIGNED NOT NUL...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `country`
--

CREATE TABLE country (
  country_id SMALLINT UNSIGNE...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `customer`
--

CREATE TABLE customer (
  customer_id SMALLINT UNSI...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `film`
--

CREATE TABLE film (
  film_id SMALLINT UNSIGNED NOT NUL...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `film_actor`
--

CREATE TABLE film_actor (
  actor_id SMALLINT UNS...
Error: near "ON": syntax error
Error executing statement:

--
-- Table structure for table `film_category`
--

CREATE TABLE film_category (
  film_id SMALLIN...
Error: near "ON": syntax error
Error executing statement:

--
-- Table structure for table `film_text`
--
-- InnoDB added FULLTEXT support in 5.6.10. If you...
Error: near "FULLTEXT": syntax error
Error executing statement:

--
-- Triggers for loading film_text from film
--

DELIMITER ...
Error: near "DELIMITER": syntax error
Error executing statement:
CREATE TRIGGER `ins_film` AFTER INSERT ON `film` FOR EACH ROW BEGIN
    INSERT INTO film_text (film...
Error: no such table: main.film
Error executing statement:
  END...
Error: cannot commit - no transaction is active
Error executing statement:


CREATE TRIGGER `upd_film` AFTER UPDATE ON `film` FOR EACH ROW BEGIN
    IF (old.title != new.titl...
Error: no such table: main.film
Error executing statement:
    END IF...
Error: near "IF": syntax error
Error executing statement:
  END...
Error: cannot commit - no transaction is active
Error executing statement:


CREATE TRIGGER `del_film` AFTER DELETE ON `film` FOR EACH ROW BEGIN
    DELETE FROM film_text WHE...
Error: no such table: main.film
Error executing statement:
  END...
Error: cannot commit - no transaction is active
Error executing statement:

DELIMITER ...
Error: near "DELIMITER": syntax error
Error executing statement:

--
-- Table structure for table `inventory`
--

CREATE TABLE inventory (
  inventory_id MEDIUMINT ...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:


--
-- Table structure for table `investor`
--

CREATE TABLE investor (
  investor_id SMALLINT UNS...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `language`
--

CREATE TABLE language (
  language_id TINYINT UNSIG...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `payment`
--

CREATE TABLE payment (
  payment_id SMALLINT UNSIGNE...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:


--
-- Table structure for table `rental`
--

CREATE TABLE rental (
  rental_id INT NOT NULL AUTO_...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `staff`
--

CREATE TABLE staff (
  staff_id TINYINT UNSIGNED NOT N...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- Table structure for table `store`
--

CREATE TABLE store (
  store_id TINYINT UNSIGNED NOT N...
Error: near "AUTO_INCREMENT": syntax error
Error executing statement:

--
-- View structure for view `customer_list`
--

CREATE VIEW customer_list
AS
SELECT cu.customer_...
Error: near "' '": syntax error
Error executing statement:

--
-- View structure for view `film_list`
--

CREATE VIEW film_list
AS
SELECT film.film_id AS FID,...
Error: near "' '": syntax error
Error executing statement:

--
-- View structure for view `nicer_but_slower_film_list`
--

CREATE VIEW nicer_but_slower_film_l...
Error: near "' '": syntax error
Error executing statement:

--
-- View structure for view `staff_list`
--

CREATE VIEW staff_list
AS
SELECT s.staff_id AS ID, ...
Error: near "' '": syntax error
Error executing statement:

--
-- View structure for view `sales_by_store`
--

CREATE VIEW sales_by_store
AS
SELECT
CONCAT(c.c...
Error: near "','": syntax error
Error executing statement:

--
-- View structure for view `actor_info`
--

CREATE DEFINER=CURRENT_USER SQL SECURITY INVOKER VI...
Error: near "DEFINER": syntax error
Error executing statement:  ')
AS film_info
FROM mavenmovies.actor a
LEFT JOIN mavenmovies.film_actor fa
  ON a.actor_id = fa.a...
Error: unrecognized token: "')
AS film_info
FROM mavenmovies.actor a
LEFT JOIN mavenmovies.film_actor fa
  ON a.actor_id = fa.actor_id
LEFT JOIN mavenmovies.film_category fc
  ON fa.film_id = fc.film_id
LEFT JOIN mavenmovies.category c
  ON fc.category_id = c.category_id
GROUP BY a.actor_id, a.first_name, a.last_name;"
Error executing statement:

--
-- Procedure structure for procedure `rewards_report`
--

DELIMITER //

CREATE PROCEDURE reward...
Error: near "DELIMITER": syntax error
Error executing statement:
    DECLARE last_month_end DATE...
Error: near "DECLARE": syntax error
Error executing statement:

    /* Some sanity checks... */
    IF min_monthly_purchases = 0 THEN
        SELECT 'Minimum mont...
Error: near "IF": syntax error
Error executing statement:
        LEAVE proc...
Error: near "LEAVE": syntax error
Error executing statement:
    END IF...
Error: near "IF": syntax error
Error executing statement:
    IF min_dollar_amount_purchased = 0.00 THEN
        SELECT 'Minimum monthly dollar amount purcha...
Error: near "IF": syntax error
Error executing statement:
        LEAVE proc...
Error: near "LEAVE": syntax error
Error executing statement:
    END IF...
Error: near "IF": syntax error
Error executing statement:

    /* Determine start and end time periods */
    SET last_month_start = DATE_SUB(CURRENT_DATE(),...
Error: near "SET": syntax error
Error executing statement:
    SET last_month_start = STR_TO_DATE(CONCAT(YEAR(last_month_start),'-',MONTH(last_month_start),'-...
Error: near "SET": syntax error
Error executing statement:
    SET last_month_end = LAST_DAY(last_month_start)...
Error: near "SET": syntax error
Error executing statement:

    /*
        Find all customers meeting the
        monthly purchase requirements
    */
    INS...
Error: no such table: payment
Error executing statement:

    /* Populate OUT parameter with count of found customers */
    SELECT COUNT(*) FROM tmpCustome...
Error: near "INTO": syntax error
Error executing statement:

    /*
        Output ALL customer information of matching rewardees.
        Customize output as ...
Error: no such table: customer
Error executing statement:
END //

DELIMITER ...
Error: near "/": syntax error
Error executing statement:

DELIMITER $$

CREATE FUNCTION get_customer_balance(p_customer_id INT, p_effective_date DATETIME) R...
Error: near "DELIMITER": syntax error
Error executing statement:  #FEES PAID TO RENT THE VIDEOS INITIALLY
  DECLARE v_overfees INTEGER...
Error: near "#FEES": syntax error
Error executing statement:       #LATE FEES FOR PRIOR RENTALS
  DECLARE v_payments DECIMAL(5,2)...
Error: near "#LATE": syntax error
Error executing statement:  #SUM OF PAYMENTS MADE PREVIOUSLY

  SELECT IFNULL(SUM(film.rental_rate),0) INTO v_rentfees
    FROM...
Error: near "#SUM": syntax error
Error executing statement:

  SELECT IFNULL(SUM(IF((TO_DAYS(rental.return_date) - TO_DAYS(rental.rental_date)) > film.rental_d...
Error: near "INTO": syntax error
Error executing statement:


  SELECT IFNULL(SUM(payment.amount),0) INTO v_payments
    FROM payment

    WHERE payment.paymen...
Error: near "INTO": syntax error
Error executing statement:

  RETURN v_rentfees + v_overfees - v_payments...
Error: near "RETURN": syntax error
Error executing statement:
END $$

DELIMITER ...
Error: near "$$": syntax error
Error executing statement:

DELIMITER $$

CREATE PROCEDURE film_in_stock(IN p_film_id INT, IN p_store_id INT, OUT p_film_count...
Error: near "DELIMITER": syntax error
Error executing statement:

     SELECT FOUND_ROWS() INTO p_film_count...
Error: near "INTO": syntax error
Error executing statement:
END $$

DELIMITER ...
Error: near "$$": syntax error
Error executing statement:

DELIMITER $$

CREATE PROCEDURE film_not_in_stock(IN p_film_id INT, IN p_store_id INT, OUT p_film_c...
Error: near "DELIMITER": syntax error
Error executing statement:

     SELECT FOUND_ROWS() INTO p_film_count...
Error: near "INTO": syntax error
Error executing statement:
END $$

DELIMITER ...
Error: near "$$": syntax error
Error executing statement:

DELIMITER $$

CREATE FUNCTION inventory_held_by_customer(p_inventory_id INT) RETURNS INT
READS SQL...
Error: near "DELIMITER": syntax error
Error executing statement:
  DECLARE EXIT HANDLER FOR NOT FOUND RETURN NULL...
Error: near "DECLARE": syntax error
Error executing statement:

  SELECT customer_id INTO v_customer_id
  FROM rental
  WHERE return_date IS NULL
  AND inventory_...
Error: near "INTO": syntax error
Error executing statement:

  RETURN v_customer_id...
Error: near "RETURN": syntax error
Error executing statement:
END $$

DELIMITER ...
Error: near "$$": syntax error
Error executing statement:

DELIMITER $$

CREATE FUNCTION inventory_in_stock(p_inventory_id INT) RETURNS BOOLEAN
READS SQL DAT...
Error: near "DELIMITER": syntax error
Error executing statement:
    DECLARE v_out     INT...
Error: near "DECLARE": syntax error
Error executing statement:

    #AN ITEM IS IN-STOCK IF THERE ARE EITHER NO ROWS IN THE rental TABLE
    #FOR THE ITEM OR ALL ...
Error: near "#AN": syntax error
Error executing statement:

    IF v_rentals = 0 THEN
      RETURN TRUE...
Error: near "IF": syntax error
Error executing statement:
    END IF...
Error: near "IF": syntax error
Error executing statement:

    SELECT COUNT(rental_id) INTO v_out
    FROM inventory LEFT JOIN rental USING(inventory_id)
   ...
Error: near "INTO": syntax error
Error executing statement:

    IF v_out > 0 THEN
      RETURN FALSE...
Error: near "IF": syntax error
Error executing statement:
    ELSE
      RETURN TRUE...
Error: near "ELSE": syntax error
Error executing statement:
    END IF...
Error: near "IF": syntax error
Error executing statement:
END $$

DELIMITER ...
Error: near "$$": syntax error
Error executing statement:
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS...
Error: near "SET": syntax error
Error executing statement:
SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS...
Error: near "SET": syntax error
Error executing statement:  LOSS OF USE, DATA, OR PROFITS...
Error: near "LOSS": syntax error
Error executing statement:  OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRIC...
Error: near "OR": syntax error
Error executing statement:
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0...
Error: near "SET": syntax error
Error executing statement:

USE mavenmovies...
Error: near "USE": syntax error
Error executing statement:

--
-- Dumping data for table actor
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO actor VALUES (1,'PENELOPE','GUINESS','2006-02-15 04:34:33'),
(2,'NICK','WAHLBERG','2006...
Error: no such table: actor
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table actor_award
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO actor_award VALUES
(1,12,'KARL','BERRY','Emmy, Oscar, Tony ','2006-02-15 04:34:33'),
(...
Error: no such table: actor_award
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table address
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO `address` VALUES (1,'47 MySakila Drive',NULL,'Alberta',300,'','',/* !50705 0x0000000001...
Error: no such table: address
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table advisor
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO advisor VALUES (1,'Barry','Beenthere',1),
(2,'Cindy','Smartypants',0),
(3,'Mary','Money...
Error: no such table: advisor
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table category
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO category VALUES (1,'Action','2006-02-15 04:46:27'),
(2,'Animation','2006-02-15 04:46:27...
Error: no such table: category
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table city
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO city VALUES (1,'A Corua (La Corua)',87,'2006-02-15 04:45:25'),
(2,'Abha',82,'2006-02-15...
Error: no such table: city
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table country
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO country VALUES (1,'Afghanistan','2006-02-15 04:44:00'),
(2,'Algeria','2006-02-15 04:44:...
Error: no such table: country
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table customer
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO customer VALUES (1,1,'MARY','SMITH','MARY.SMITH@sakilacustomer.org',5,1,'2006-02-14 22:...
Error: no such table: customer
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Trigger to enforce create dates on INSERT
--

CREATE TRIGGER customer_create_date BEFORE INS...
Error: near "SET": syntax error
Error executing statement:

--
-- Dumping data for table film
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO film VALUES (1,'ACADEMY DINOSAUR','A Epic Drama of a Feminist And a Mad Scientist who m...
Error: no such table: film
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table film_actor
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO film_actor VALUES (1,1,'2006-02-15 05:05:03'),
(1,23,'2006-02-15 05:05:03'),
(1,25,'200...
Error: no such table: film_actor
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table film_category
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO film_category VALUES (1,6,'2006-02-15 05:07:09'),
(2,11,'2006-02-15 05:07:09'),
(3,6,'2...
Error: no such table: film_category
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table inventory
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO inventory VALUES (1,1,1,'2006-02-15 05:09:17'),
(2,1,1,'2006-02-15 05:09:17'),
(3,1,1,'...
Error: no such table: inventory
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table investor
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO investor VALUES (1,'Montgomery','Burns','Springfield Syndicators'),
(2,'Anthony','Stark...
Error: no such table: investor
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:


--
-- Dumping data for table language
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO language VALUES (1,'English','2006-02-15 05:02:19'),
(2,'Italian','2006-02-15 05:02:19'...
Error: no such table: language
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table payment
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO payment VALUES (1,1,1,76,'2.99','2005-05-25 11:30:37','2006-02-15 22:12:30'),
(2,1,1,57...
Error: no such table: payment
Error executing statement:
INSERT INTO payment VALUES (14886,555,2,12182,'2.99','2005-08-18 01:30:19','2006-02-15 22:21:53'),
...
Error: no such table: payment
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Trigger to enforce payment_date during INSERT
--

CREATE TRIGGER payment_date BEFORE INSERT ...
Error: near "SET": syntax error
Error executing statement:

--
-- Dumping data for table rental
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO rental VALUES (1,'2005-05-24 22:53:30',367,130,'2005-05-26 22:04:30',1,'2006-02-15 21:3...
Error: no such table: rental
Error executing statement:
INSERT INTO rental VALUES (12382,'2005-08-18 08:32:33',3049,566,'2005-08-26 03:45:33',2,'2006-02-15...
Error: no such table: rental
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Trigger to enforce rental_date on INSERT
--

CREATE TRIGGER rental_date BEFORE INSERT ON ren...
Error: near "SET": syntax error
Error executing statement:

--
-- Dumping data for table staff
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:

--
-- Dumping data for table `staff`
--

LOCK TABLES `staff` WRITE...
Error: near "LOCK": syntax error
Error executing statement:
INSERT INTO `staff` VALUES (1,'Mike','Hillyer',3,0x89504E470D0A1A0A0000000D494844520000007900000075...
Error: no such table: staff
Error executing statement:
UNLOCK TABLES...
Error: near "UNLOCK": syntax error
Error executing statement:
COMMIT...
Error: cannot commit - no transaction is active
Error executing statement:

--
-- Dumping data for table store
--

SET AUTOCOMMIT=0...
Error: near "SET": syntax error
Error executing statement:
INSERT INTO store VALUES (1,1,1,'2006-02-15 04:57:12'),
(2,2,2,'2006-02-15 04:57:12')...
Error: no such table: store

2.Retrieve the total number of rentals made in the Sakila database.

In [8]:
#code
%%sql
SELECT AVG(rental_duration) AS AverageRentalDurationInDays
FROM film;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: SELECT AVG(rental_duration) AS AverageRentalDurationInDays
FROM film;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

3.Display the first name and last name of customers in uppercase.

In [11]:
#code
%%sql
SELECT UPPER(first_name) AS uppercase_first_name,
       UPPER(last_name) AS uppercase_last_name
FROM customer;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: SELECT UPPER(first_name) AS uppercase_first_name,
       UPPER(last_name) AS uppercase_last_name
FROM customer;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

4.Extract the month from the rental date and display it alongside the rental ID.

In [13]:
#code
%%sql
SELECT
    rental_id,
    strftime('%M', rental_date) AS rental_month
FROM
    rental;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: rental
[SQL: SELECT
    rental_id,
    strftime('%M', rental_date) AS rental_month
FROM
    rental;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

5.Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

In [15]:
#code
%%sql
SELECT
    c.customer_id,
    COUNT(r.rental_id) AS rental_count
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
GROUP BY
    c.customer_id
ORDER BY
    c.customer_id;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: SELECT
    c.customer_id,
    COUNT(r.rental_id) AS rental_count
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
GROUP BY
    c.customer_id
ORDER BY
    c.customer_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

6.Find the total revenue generated by each store.

In [17]:
#code
%%sql
SELECT
    store_name,
    SUM(price * quantity * (1 - discount)) AS total_revenue
FROM
    sales
GROUP BY
    store_name
ORDER BY
    total_revenue DESC, store_name ASC;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: sales
[SQL: SELECT
    store_name,
    SUM(price * quantity * (1 - discount)) AS total_revenue
FROM
    sales
GROUP BY
    store_name
ORDER BY
    total_revenue DESC, store_name ASC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

7.Determine the total number of rentals for each category of movies.

In [19]:
#code
%%sql
SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS total_rentals
FROM
    category AS c
JOIN
    film_category AS fc ON c.category_id = fc.category_id
JOIN
    film AS f ON fc.film_id = f.film_id
JOIN
    inventory AS i ON f.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    total_rentals DESC;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: category
[SQL: SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS total_rentals
FROM
    category AS c
JOIN
    film_category AS fc ON c.category_id = fc.category_id
JOIN
    film AS f ON fc.film_id = f.film_id
JOIN
    inventory AS i ON f.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    total_rentals DESC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

8.Find the average rental rate of movies in each language.

In [21]:
#code
%%sql
SELECT
    l.name AS language_name,
    AVG(f.rental_rate) AS average_rental_rate
FROM
    film AS f
JOIN
    language AS l ON f.language_id = l.language_id
GROUP BY
    l.name;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: SELECT
    l.name AS language_name,
    AVG(f.rental_rate) AS average_rental_rate
FROM
    film AS f
JOIN
    language AS l ON f.language_id = l.language_id
GROUP BY
    l.name;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#Joins

9.Display the title of the movie, customer s first name, and last name who rented it.

In [23]:
#code
%%sql
SELECT
    f.title,
    c.first_name,
    c.last_name
FROM
    film AS f
INNER JOIN
    inventory AS i ON f.film_id = i.film_id
INNER JOIN
    rental AS r ON i.inventory_id = r.inventory_id
INNER JOIN
    customer AS c ON r.customer_id = c.customer_id;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: SELECT
    f.title,
    c.first_name,
    c.last_name
FROM
    film AS f
INNER JOIN
    inventory AS i ON f.film_id = i.film_id
INNER JOIN
    rental AS r ON i.inventory_id = r.inventory_id
INNER JOIN
    customer AS c ON r.customer_id = c.customer_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

10.Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

In [27]:
#code
%%sql
SELECT
    A.first_name, A.last_name
FROM
    actor AS A
JOIN
    film_actor AS FA ON A.actor_id = FA.actor_id
JOIN
    film AS F ON FA.film_id = F.film_id
WHERE
    F.title = 'Gone with the Wind';

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: actor
[SQL: SELECT
    A.first_name, A.last_name
FROM
    actor AS A
JOIN
    film_actor AS FA ON A.actor_id = FA.actor_id
JOIN
    film AS F ON FA.film_id = F.film_id
WHERE
    F.title = 'Gone with the Wind';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

11.Retrieve the customer names along with the total amount they've spent on rentals.

In [29]:
#code
%%sql
SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_rental_amount
FROM
    customer AS c
JOIN
    rental AS r ON c.customer_id = r.customer_id
JOIN
    payment AS p ON r.rental_id = p.rental_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_rental_amount DESC;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: SELECT
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_rental_amount
FROM
    customer AS c
JOIN
    rental AS r ON c.customer_id = r.customer_id
JOIN
    payment AS p ON r.rental_id = p.rental_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_rental_amount DESC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

12.List the titles of movies rented by each customer in a particular city (e.g., 'London').

In [31]:
#code
%%sql
SELECT
    c.first_name,
    c.last_name,
    f.title
FROM
    customer AS c
JOIN
    address AS a ON c.address_id = a.address_id
JOIN
    city AS ci ON a.city_id = ci.city_id
JOIN
    rental AS r ON c.customer_id = r.customer_id
JOIN
    inventory AS i ON r.inventory_id = i.inventory_id
JOIN
    film AS f ON i.film_id = f.film_id
WHERE
    ci.city = 'London'
ORDER BY
    c.first_name, c.last_name, f.title;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: SELECT
    c.first_name,
    c.last_name,
    f.title
FROM
    customer AS c
JOIN
    address AS a ON c.address_id = a.address_id
JOIN
    city AS ci ON a.city_id = ci.city_id
JOIN
    rental AS r ON c.customer_id = r.customer_id
JOIN
    inventory AS i ON r.inventory_id = i.inventory_id
JOIN
    film AS f ON i.film_id = f.film_id
WHERE
    ci.city = 'London'
ORDER BY
    c.first_name, c.last_name, f.title;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#Advanced Joins and GROUP BY:

13.Display the top 5 rented movies along with the number of times they've been rented.

In [33]:
#code
%%sql
SELECT
    f.title AS movie_title,
    COUNT(r.rental_id) AS rental_count
FROM
    film AS f
JOIN
    inventory AS i ON f.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    f.title
ORDER BY
    rental_count DESC
LIMIT 5;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: SELECT
    f.title AS movie_title,
    COUNT(r.rental_id) AS rental_count
FROM
    film AS f
JOIN
    inventory AS i ON f.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    f.title
ORDER BY
    rental_count DESC
LIMIT 5;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

14.Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).

In [35]:
#code
%%sql
SELECT
    c.customer_id,
    c.first_name,
    c.last_name
FROM
    customer AS c
JOIN
    rental AS r ON c.customer_id = r.customer_id
JOIN
    inventory AS i ON r.inventory_id = i.inventory_id
WHERE
    i.store_id IN (1, 2)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(DISTINCT i.store_id) = 2;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: SELECT
    c.customer_id,
    c.first_name,
    c.last_name
FROM
    customer AS c
JOIN
    rental AS r ON c.customer_id = r.customer_id
JOIN
    inventory AS i ON r.inventory_id = i.inventory_id
WHERE
    i.store_id IN (1, 2)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    COUNT(DISTINCT i.store_id) = 2;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#Windows Function:

1.Rank the customers based on the total amount they've spent on rentals.

In [37]:
#code
%%sql
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_spent DESC;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    SUM(p.amount) AS total_spent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name
ORDER BY
    total_spent DESC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

2.Calculate the cumulative revenue generated by each film over time.

In [39]:
#code
%%sql
SELECT
    film_id,
    revenue_date,
    SUM(daily_revenue) OVER (PARTITION BY film_id ORDER BY revenue_date) AS cumulative_revenue
FROM
    film_revenue
ORDER BY
    film_id, revenue_date;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film_revenue
[SQL: SELECT
    film_id,
    revenue_date,
    SUM(daily_revenue) OVER (PARTITION BY film_id ORDER BY revenue_date) AS cumulative_revenue
FROM
    film_revenue
ORDER BY
    film_id, revenue_date;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

3. Determine the average rental duration for each film, considering films with similar lengths.

In [41]:
#code
%%sql
SELECT
    length_category, -- This would be a derived column representing your defined length categories
    AVG(rental_duration) AS average_rental_duration
FROM
    (
        SELECT
            rental_duration,
            -- Logic to define length_category based on film length
            CASE
                WHEN length <= 90 THEN 'Short'
                WHEN length > 90 AND length <= 120 THEN 'Medium'
                ELSE 'Long'
            END AS length_category
        FROM
            film -- Assuming 'film' is your table with film details
    ) AS categorized_films
GROUP BY
    length_category;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: SELECT
    length_category, -- This would be a derived column representing your defined length categories
    AVG(rental_duration) AS average_rental_duration
FROM
    (
        SELECT
            rental_duration,
            -- Logic to define length_category based on film length
            CASE
                WHEN length <= 90 THEN 'Short'
                WHEN length > 90 AND length <= 120 THEN 'Medium'
                ELSE 'Long'
            END AS length_category
        FROM
            film -- Assuming 'film' is your table with film details
    ) AS categorized_films
GROUP BY
    length_category;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

3.Identify the top 3 films in each category based on their rental counts.

In [43]:
#code
%%sql
WITH FilmRentalCounts AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM
        film AS f
    JOIN
        inventory AS i ON f.film_id = i.film_id
    JOIN
        rental AS r ON i.inventory_id = r.inventory_id
    JOIN
        film_category AS fc ON f.film_id = fc.film_id
    JOIN
        category AS c ON fc.category_id = c.category_id
    GROUP BY
        f.film_id, f.title, c.name
),
RankedFilms AS (
    SELECT
        film_id,
        title,
        category_name,
        rental_count,
        ROW_NUMBER() OVER (PARTITION BY category_name ORDER BY rental_count DESC) AS rank_in_category
    FROM
        FilmRentalCounts
)
SELECT
    category_name,
    title,
    rental_count
FROM
    RankedFilms
WHERE
    rank_in_category <= 3
ORDER BY
    category_name, rental_count DESC;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: WITH FilmRentalCounts AS (
    SELECT
        f.film_id,
        f.title,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM
        film AS f
    JOIN
        inventory AS i ON f.film_id = i.film_id
    JOIN
        rental AS r ON i.inventory_id = r.inventory_id
    JOIN
        film_category AS fc ON f.film_id = fc.film_id
    JOIN
        category AS c ON fc.category_id = c.category_id
    GROUP BY
        f.film_id, f.title, c.name
),
RankedFilms AS (
    SELECT
        film_id,
        title,
        category_name,
        rental_count,
        ROW_NUMBER() OVER (PARTITION BY category_name ORDER BY rental_count DESC) AS rank_in_category
    FROM
        FilmRentalCounts
)
SELECT
    category_name,
    title,
    rental_count
FROM
    RankedFilms
WHERE
    rank_in_category <= 3
ORDER BY
    category_name, rental_count DESC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

5.Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

In [45]:
#code
%%sql
SELECT
    c.customer_id,
    c.total_rentals,
    (c.total_rentals - (SELECT AVG(total_rentals) FROM (SELECT customer_id, COUNT(rental_id) AS total_rentals FROM rental GROUP BY customer_id) AS sub_avg)) AS difference_from_average
FROM
    (SELECT customer_id, COUNT(rental_id) AS total_rentals FROM rental GROUP BY customer_id) AS c;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: rental
[SQL: SELECT
    c.customer_id,
    c.total_rentals,
    (c.total_rentals - (SELECT AVG(total_rentals) FROM (SELECT customer_id, COUNT(rental_id) AS total_rentals FROM rental GROUP BY customer_id) AS sub_avg)) AS difference_from_average
FROM
    (SELECT customer_id, COUNT(rental_id) AS total_rentals FROM rental GROUP BY customer_id) AS c;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

6.Find the monthly revenue trend for the entire rental store over time.

In [47]:
#code
%%sql
SELECT
    EXTRACT(YEAR FROM rental_date) AS rental_year,
    EXTRACT(MONTH FROM rental_date) AS rental_month,
    SUM(amount) AS total_monthly_revenue
FROM
    rental_transactions
    rental_year,
    rental_month
ORDER BY
    rental_year,
    rental_month;

 * sqlite:///:memory:
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT
    EXTRACT(YEAR FROM rental_date) AS rental_year,
    EXTRACT(MONTH FROM rental_date) AS rental_month,
    SUM(amount) AS total_monthly_revenue
FROM
    rental_transactions  -- Replace 'rental_transactions' with the actual name of your rental transactions table
GROUP BY
    rental_year,
    rental_month
ORDER BY
    rental_year,
    rental_month;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

In [49]:
#code
%%sql
WITH CustomerTotalSpend AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_rental_spend
    FROM
        customer AS c
    JOIN
        payment AS p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
),
RankedCustomers AS (
    SELECT
        customer_id,
        first_name,
        last_name,
        total_rental_spend,
        NTILE(5) OVER (ORDER BY total_rental_spend DESC) AS spend_quintile -- NTILE(5) for top 20%
    FROM
        CustomerTotalSpend
)
SELECT
    customer_id,
    first_name,
    last_name,
    total_rental_spend
FROM
    RankedCustomers
WHERE
    spend_quintile = 1;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: WITH CustomerTotalSpend AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_rental_spend
    FROM
        customer AS c
    JOIN
        payment AS p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, c.first_name, c.last_name
),
RankedCustomers AS (
    SELECT
        customer_id,
        first_name,
        last_name,
        total_rental_spend,
        NTILE(5) OVER (ORDER BY total_rental_spend DESC) AS spend_quintile -- NTILE(5) for top 20%
    FROM
        CustomerTotalSpend
)
SELECT
    customer_id,
    first_name,
    last_name,
    total_rental_spend
FROM
    RankedCustomers
WHERE
    spend_quintile = 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

8. Calculate the running total of rentals per category, ordered by rental count.

In [51]:
#CODE
%%sql
SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS rental_count,
    SUM(COUNT(r.rental_id)) OVER (ORDER BY COUNT(r.rental_id) ASC) AS running_total_rentals
FROM
    category c
JOIN
    film_category fc ON c.category_id = fc.category_id
JOIN
    film f ON fc.film_id = f.film_id
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    rental_count ASC;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: category
[SQL: SELECT
    c.name AS category_name,
    COUNT(r.rental_id) AS rental_count,
    SUM(COUNT(r.rental_id)) OVER (ORDER BY COUNT(r.rental_id) ASC) AS running_total_rentals
FROM
    category c
JOIN
    film_category fc ON c.category_id = fc.category_id
JOIN
    film f ON fc.film_id = f.film_id
JOIN
    inventory i ON f.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    c.name
ORDER BY
    rental_count ASC;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

9. Find the films that have been rented less than the average rental count for their respective categories.

In [53]:
#code
%%sql
SELECT
    f.title AS film_title,
    c.name AS category_name,
    COUNT(r.rental_id) AS film_rental_count
FROM
    film AS f
JOIN
    film_category AS fc ON f.film_id = fc.film_id
JOIN
    category AS c ON fc.category_id = c.category_id
JOIN
    inventory AS i ON f.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    f.title, c.name
HAVING
    COUNT(r.rental_id) < (
        SELECT AVG(rental_count)
        FROM (
            SELECT
                fc_inner.category_id,
                COUNT(r_inner.rental_id) AS rental_count
            FROM
                film AS f_inner
            JOIN
                film_category AS fc_inner ON f_inner.film_id = fc_inner.film_id
            JOIN
                inventory AS i_inner ON f_inner.film_id = i_inner.film_id
            JOIN
                rental AS r_inner ON i_inner.inventory_id = r_inner.inventory_id
            GROUP BY
                fc_inner.category_id
        ) AS category_rental_counts
    );

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: SELECT
    f.title AS film_title,
    c.name AS category_name,
    COUNT(r.rental_id) AS film_rental_count
FROM
    film AS f
JOIN
    film_category AS fc ON f.film_id = fc.film_id
JOIN
    category AS c ON fc.category_id = c.category_id
JOIN
    inventory AS i ON f.film_id = i.film_id
JOIN
    rental AS r ON i.inventory_id = r.inventory_id
GROUP BY
    f.title, c.name
HAVING
    COUNT(r.rental_id) < (
        SELECT AVG(rental_count)
        FROM (
            SELECT
                fc_inner.category_id,
                COUNT(r_inner.rental_id) AS rental_count
            FROM
                film AS f_inner
            JOIN
                film_category AS fc_inner ON f_inner.film_id = fc_inner.film_id
            JOIN
                inventory AS i_inner ON f_inner.film_id = i_inner.film_id
            JOIN
                rental AS r_inner ON i_inner.inventory_id = r_inner.inventory_id
            GROUP BY
                fc_inner.category_id
        ) AS category_rental_counts
    );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

10.Identify the top 5 months with the highest revenue and display the revenue generated in each month.

In [55]:
#code
%%sql
SELECT
    YEAR(sales_date) AS sales_year,
    MONTH(sales_date) AS sales_month,
    SUM(revenue) AS total_monthly_revenue
FROM
    sales
GROUP BY
    YEAR(sales_date),
    MONTH(sales_date)
ORDER BY
    total_monthly_revenue DESC
LIMIT 5;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: sales
[SQL: SELECT
    YEAR(sales_date) AS sales_year,
    MONTH(sales_date) AS sales_month,
    SUM(revenue) AS total_monthly_revenue
FROM
    sales
GROUP BY
    YEAR(sales_date),
    MONTH(sales_date)
ORDER BY
    total_monthly_revenue DESC
LIMIT 5;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

#Normalisation & CTE

1.Normal Form (1NF):

 a. Identify a table in the Sakila database that violates 1NF. Explain how you

 would normalize it to achieve 1NF.

In [57]:
#code
%%sql
CREATE TABLE film_actor_normalized (
    film_id SMALLINT UNSIGNED NOT NULL,
    actor_id SMALLINT UNSIGNED NOT NULL,
    PRIMARY KEY (film_id, actor_id)
);

 * sqlite:///:memory:
Done.

[]

2.Second Normal Form (2NF):

 a. Choose a table in Sakila and describe how you would determine whether it is in 2NF.

 If it violates 2NF, explain the steps to normalize it.

In [59]:
#code
%%sql
CREATE TABLE rental_extended (
    rental_id INT NOT NULL,
    rental_date DATETIME ,
    inventory_id MEDIUMINT UNSIGNED NOT NULL,
    customer_id SMALLINT UNSIGNED NOT NULL,
    return_date DATETIME DEFAULT NULL,
    staff_id SMALLINT UNSIGNED NOT NULL,
    last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP,
    customer_name VARCHAR(45), -- Added for illustration
    PRIMARY KEY (rental_id, inventory_id) -- Composite Primary Key for illustration
);

 * sqlite:///:memory:
Done.

[]

3.Third Normal Form (3NF):

 a. Identify a table in Sakila that violates 3NF. Describe the transitive dependencies

 present and outline the steps to

In [61]:
#code
%%sql
    CREATE TABLE language_details (
        language_id TINYINT UNSIGNED PRIMARY KEY,
        name VARCHAR(20) NOT NULL
    );

 * sqlite:///:memory:
Done.

[]

4.Normalization Process:

 a. Take a specific table in Sakila and guide through the process of normalizing it from the initial

 unnormalized form up to at least 2NF.

In [63]:
#code
%%sql
-- The original 'film' table in Sakila is already in 1NF
CREATE TABLE film (
    film_id SMALLINT UNSIGNED NOT NULL PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    description TEXT,
    release_year YEAR,
    language_id TINYINT UNSIGNED NOT NULL,
    original_language_id TINYINT UNSIGNED DEFAULT NULL,
    rental_duration TINYINT UNSIGNED NOT NULL DEFAULT 3,
    rental_rate DECIMAL(4,2) NOT NULL DEFAULT 4.99,
    length SMALLINT UNSIGNED DEFAULT NULL,
    replacement_cost DECIMAL(5,2) NOT NULL DEFAULT 19.99,
    rating ENUM('G','PG','PG-13','R','NC-17') DEFAULT 'G',
    special_features SET('Trailers','Commentaries','Deleted Scenes','Behind the Scenes') DEFAULT NULL,
    last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

 * sqlite:///:memory:
(sqlite3.OperationalError) near "'G'": syntax error
[SQL: -- The original 'film' table in Sakila is already in 1NF
CREATE TABLE film (
    film_id SMALLINT UNSIGNED NOT NULL PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    description TEXT,
    release_year YEAR,
    language_id TINYINT UNSIGNED NOT NULL,
    original_language_id TINYINT UNSIGNED DEFAULT NULL,
    rental_duration TINYINT UNSIGNED NOT NULL DEFAULT 3,
    rental_rate DECIMAL(4,2) NOT NULL DEFAULT 4.99,
    length SMALLINT UNSIGNED DEFAULT NULL,
    replacement_cost DECIMAL(5,2) NOT NULL DEFAULT 19.99,
    rating ENUM('G','PG','PG-13','R','NC-17') DEFAULT 'G',
    special_features SET('Trailers','Commentaries','Deleted Scenes','Behind the Scenes') DEFAULT NULL,
    last_update TIMESTAMP NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

5. CTE Basics:

 a. Write a query using a CTE to retrieve the distinct list of actor names and the number of films they

 have acted in from the actor and film_actor tables.

In [65]:
#code
%%sql
WITH ActorFilmCounts AS (
    SELECT
        a.first_name,
        a.last_name,
        COUNT(fa.film_id) AS number_of_films
    FROM
        actor AS a
    JOIN
        film_actor AS fa ON a.actor_id = fa.actor_id
    GROUP BY
        a.actor_id, a.first_name, a.last_name
)
SELECT
    first_name,
    last_name,
    number_of_films
FROM
    ActorFilmCounts
ORDER BY
    number_of_films DESC, last_name, first_name;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: actor
[SQL: WITH ActorFilmCounts AS (
    SELECT
        a.first_name,
        a.last_name,
        COUNT(fa.film_id) AS number_of_films
    FROM
        actor AS a
    JOIN
        film_actor AS fa ON a.actor_id = fa.actor_id
    GROUP BY
        a.actor_id, a.first_name, a.last_name
)
SELECT
    first_name,
    last_name,
    number_of_films
FROM
    ActorFilmCounts
ORDER BY
    number_of_films DESC, last_name, first_name;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

6.CTE with Joins:

 a. Create a CTE that combines information from the film and language tables to display the film title,

 language name, and rental rate.

In [67]:
%%sql
WITH FilmLanguageDetails AS (
    SELECT
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
    FROM
        film f
    JOIN
        language l ON f.language_id = l.language_id
)
SELECT
    film_title,
    language_name,
    rental_rate
FROM
    FilmLanguageDetails;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: WITH FilmLanguageDetails AS (
    SELECT
        f.title AS film_title,  -- Select the film title and alias it
        l.name AS language_name, -- Select the language name and alias it
        f.rental_rate           -- Select the rental rate
    FROM
        film f                  -- Specify the film table and assign an alias
    JOIN
        language l ON f.language_id = l.language_id -- Join the tables on the language_id column
)
SELECT
    film_title,
    language_name,
    rental_rate
FROM
    FilmLanguageDetails;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

7.CTE for Aggregation:

 a. Write a query using a CTE to find the total revenue generated by each customer (sum of payments)

 from the customer and payment tables.

In [69]:
#code
%%sql
WITH CustomerPayments AS (
    SELECT
        p.customer_id,
        SUM(p.amount) AS total_payment_amount
    FROM
        payment p
    GROUP BY
        p.customer_id
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    cp.total_payment_amount AS total_revenue
FROM
    customer c
JOIN
    CustomerPayments cp ON c.customer_id = cp.customer_id;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: WITH CustomerPayments AS (
    SELECT
        p.customer_id,
        SUM(p.amount) AS total_payment_amount
    FROM
        payment p
    GROUP BY
        p.customer_id
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    cp.total_payment_amount AS total_revenue
FROM
    customer c
JOIN
    CustomerPayments cp ON c.customer_id = cp.customer_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

8.CTE with Window Functions:

 a. Utilize a CTE with a window function to rank films based on their rental duration from the film table.

In [71]:
#code
%%sql
WITH RankedFilms AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS rental_rank
    FROM
        film
)
SELECT
    film_id,
    title,
    rental_duration,
    rental_rank
FROM
    RankedFilms
ORDER BY
    rental_rank;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film
[SQL: WITH RankedFilms AS (
    SELECT
        film_id,
        title,
        rental_duration,
        RANK() OVER (ORDER BY rental_duration DESC) AS rental_rank
    FROM
        film
)
SELECT
    film_id,
    title,
    rental_duration,
    rental_rank
FROM
    RankedFilms
ORDER BY
    rental_rank;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

9.CTE and filtering:

 a. Create a CTE to list customers who have made more than two rentals, and then join this CTE with the

 customer table to retrieve additional customer details.

In [73]:
#code
%%sql
WITH CustomerRentalCount AS (
    SELECT
        customer_id,
        COUNT(rental_id) AS total_rentals
    FROM
        rental
    GROUP BY
        customer_id
    HAVING
        COUNT(rental_id) > 2
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    crc.total_rentals
FROM
    customer AS c
JOIN
    CustomerRentalCount AS crc ON c.customer_id = crc.customer_id;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: customer
[SQL: WITH CustomerRentalCount AS (
    SELECT
        customer_id,
        COUNT(rental_id) AS total_rentals
    FROM
        rental
    GROUP BY
        customer_id
    HAVING
        COUNT(rental_id) > 2
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    crc.total_rentals
FROM
    customer AS c
JOIN
    CustomerRentalCount AS crc ON c.customer_id = crc.customer_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

10.CTE for Date Calculations:

 a. Write a query using a CTE to find the total number of rentals made each month, considering the

 rental_date from the rental table

In [75]:
#code
%%sql
WITH MonthlyRentals AS (
    SELECT
        strftime('%Y-%m', rental_date) AS rental_month,
        COUNT(rental_id) AS total_rentals
    FROM
        rental
    GROUP BY
        rental_month
)
SELECT
    rental_month,
    total_rentals
FROM
    MonthlyRentals
ORDER BY
    rental_month;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: rental
[SQL: WITH MonthlyRentals AS (
    SELECT
        strftime('%Y-%m', rental_date) AS rental_month,
        COUNT(rental_id) AS total_rentals
    FROM
        rental
    GROUP BY
        rental_month
)
SELECT
    rental_month,
    total_rentals
FROM
    MonthlyRentals
ORDER BY
    rental_month;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

11.CTE and Self-Join:

 a. Create a CTE to generate a report showing pairs of actors who have appeared in the same film

 together, using the film_actor table.

In [77]:
#code
%%sql
WITH FilmActorPairs AS (
    SELECT
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id,
        fa1.film_id
    FROM
        film_actor fa1
    JOIN
        film_actor fa2 ON fa1.film_id = fa2.film_id
    WHERE
        fa1.actor_id < fa2.actor_id -- To avoid duplicate pairs (e.g., A,B and B,A) and self-pairing
)
SELECT
    fap.actor1_id,
    fap.actor2_id,
    COUNT(DISTINCT fap.film_id) AS films_together
FROM
    FilmActorPairs fap
GROUP BY
    fap.actor1_id,
    fap.actor2_id
ORDER BY
    films_together DESC, fap.actor1_id, fap.actor2_id;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: film_actor
[SQL: WITH FilmActorPairs AS (
    SELECT
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id,
        fa1.film_id
    FROM
        film_actor fa1
    JOIN
        film_actor fa2 ON fa1.film_id = fa2.film_id
    WHERE
        fa1.actor_id < fa2.actor_id -- To avoid duplicate pairs (e.g., A,B and B,A) and self-pairing
)
SELECT
    fap.actor1_id,
    fap.actor2_id,
    COUNT(DISTINCT fap.film_id) AS films_together
FROM
    FilmActorPairs fap
GROUP BY
    fap.actor1_id,
    fap.actor2_id
ORDER BY
    films_together DESC, fap.actor1_id, fap.actor2_id;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

12.CTE for Recursive Search:

 a. Implement a recursive CTE to find all employees in the staff table who report to a specific manager,

 considering the reports_to column.

In [79]:
#code
%%sql
WITH RECURSIVE EmployeeHierarchy AS (
    SELECT
        staff_id,
        first_name,
        last_name,
        reports_to
    FROM
        staff
    WHERE
        staff_id = 2

    UNION ALL

    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM
        staff s
    INNER JOIN
        EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)
SELECT
    staff_id,
    first_name,
    last_name,
    reports_to
FROM
    EmployeeHierarchy;

 * sqlite:///:memory:
(sqlite3.OperationalError) no such table: staff
[SQL: WITH RECURSIVE EmployeeHierarchy AS (
    -- Anchor member: Select the initial manager(s)
    SELECT
        staff_id,
        first_name,
        last_name,
        reports_to
    FROM
        staff
    WHERE
        staff_id = 2 -- Replace with the ID of the manager you want to start with

    UNION ALL

    -- Recursive member: Find employees who report to the employees found in the previous step
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM
        staff s
    INNER JOIN
        EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)
SELECT
    staff_id,
    first_name,
    last_name,
    reports_to
FROM
    EmployeeHierarchy;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)